### Introduction To Pandas Module
Here, we are learning data analysis. Pandas is a software library written for the Python programming language that helps with data manipulation and analysis. It offers various data structures which help in the manipulation of data. <br>
One of the data structures used is DataFrame.<br>
DataFrame is used as a way to store data in a rectangular grid.<br>
Similar to how data is stored in Microsoft Excel.
### Installation
We can easily install this library using the terminal. Follow the steps given below to install Pandas:<br>
Step 1: Go to the Windows PowerShell.<br>
Step 2: We can install pandas with the help of pip easily. Head over to the directory where you want to install the pandas and fire the below command:<br>
__pip install pandas__<br>
This is very simple to install.

In [ ]:
# !pip install pandas

### Other way to install
If the above steps do not work for you, here is another way to install:<br>
Step 1: Go to your browser. Search for __python unofficial binaries__, or click <br>
https://www.lfd.uci.edu/~gohlke/pythonlibs/<br> 
and you will be redirected to the binary page.<br>
Step 2: To download the library, search for pandas â€“ Ctrl + F will help you. Download pandas library based on your python version. <br>
Step 3: After the installation, head over to the directory where you've downloaded the pandas. <br>
Step 4: Right-click to open Windows PowerShell. Pip can help us with the installation. Just go to that location in your terminal and run the following command: <br>
__pip install pandas__ <br>
Complete this command by the TAB button so that the location of your folder is mentioned.

### import pandas
Once Pandas is installed, import it in your applications by adding the import keyword:<br>
__import pandas as pd__<br>
Now Pandas is imported and ready to use.

In [1]:
import pandas

In [12]:
dict1 = {
    'Name': ["Ali Raza", "Zain Ahmed", "Fatima Noor", "Hassan Tariq", "Areeba Khan"],
    'Marks': [88, 67, 91, 74, 59],
    'Class': ["1st Year", "2nd Year", "3rd Year", "1st Year", "2nd Year"]
}

In [15]:
df = pandas.DataFrame(dict1)

In [16]:
df = pandas.DataFrame(dict1)

In [17]:
df

           Name  Marks     Class
0      Ali Raza     88  1st Year
1    Zain Ahmed     67  2nd Year
2   Fatima Noor     91  3rd Year
3  Hassan Tariq     74  1st Year
4   Areeba Khan     59  2nd Year

### Pandas as pd
Pandas is usually imported under the pd alias.
#### alias: 
In Python alias are an alternate name for referring to the same thing.<br>
Create an alias with the as keyword while importing:<br>
__import pandas as pd__<br>
Now the Pandas package can be referred to as pd instead of pandas.

In [18]:
import pandas as pd

In [19]:
df = pd.DataFrame(dict1)

In [20]:
df

           Name  Marks     Class
0      Ali Raza     88  1st Year
1    Zain Ahmed     67  2nd Year
2   Fatima Noor     91  3rd Year
3  Hassan Tariq     74  1st Year
4   Areeba Khan     59  2nd Year

### Checking Pandas Version
The version string is stored under __version__ attribute.

In [21]:
pd.__version__

'1.1.5'

## Import to CSV

In [22]:
df.to_csv('dataset.csv')

## Remove Index

In [23]:
df.to_csv('pythonMondayRemoveIndex.csv', index=False)

## Show some rows from the Start

In [24]:
df.head()

           Name  Marks     Class
0      Ali Raza     88  1st Year
1    Zain Ahmed     67  2nd Year
2   Fatima Noor     91  3rd Year
3  Hassan Tariq     74  1st Year
4   Areeba Khan     59  2nd Year

In [25]:
df.head()

           Name  Marks     Class
0      Ali Raza     88  1st Year
1    Zain Ahmed     67  2nd Year
2   Fatima Noor     91  3rd Year
3  Hassan Tariq     74  1st Year
4   Areeba Khan     59  2nd Year

In [26]:
df.tail(3)

           Name  Marks     Class
2   Fatima Noor     91  3rd Year
3  Hassan Tariq     74  1st Year
4   Areeba Khan     59  2nd Year

In [27]:
df.tail()

           Name  Marks     Class
0      Ali Raza     88  1st Year
1    Zain Ahmed     67  2nd Year
2   Fatima Noor     91  3rd Year
3  Hassan Tariq     74  1st Year
4   Areeba Khan     59  2nd Year

In [28]:
df.describe()

           Marks
count   5.000000
mean   75.800000
std    13.627179
min    59.000000
25%    67.000000
50%    74.000000
75%    88.000000
max    91.000000

In [29]:
classData= pd.read_csv("dataset.csv")

In [30]:
classData

   Unnamed: 0          Name  Marks     Class
0           0      Ali Raza     88  1st Year
1           1    Zain Ahmed     67  2nd Year
2           2   Fatima Noor     91  3rd Year
3           3  Hassan Tariq     74  1st Year
4           4   Areeba Khan     59  2nd Year

In [31]:
classData.drop(0, axis=0)

   Unnamed: 0          Name  Marks     Class
1           1    Zain Ahmed     67  2nd Year
2           2   Fatima Noor     91  3rd Year
3           3  Hassan Tariq     74  1st Year
4           4   Areeba Khan     59  2nd Year

In [32]:
classData

   Unnamed: 0          Name  Marks     Class
0           0      Ali Raza     88  1st Year
1           1    Zain Ahmed     67  2nd Year
2           2   Fatima Noor     91  3rd Year
3           3  Hassan Tariq     74  1st Year
4           4   Areeba Khan     59  2nd Year

In [35]:
classData['Marks']

0    88
1    67
2    91
3    74
4    59
Name: Marks, dtype: int64

In [37]:
classData['Class']

0    1st Year
1    2nd Year
2    3rd Year
3    1st Year
4    2nd Year
Name: Class, dtype: object

In [40]:
classData['Name']

0        Ali Raza
1      Zain Ahmed
2     Fatima Noor
3    Hassan Tariq
4     Areeba Khan
Name: Name, dtype: object

In [41]:
classData['Unnamed: 0']

0    0
1    1
2    2
3    3
4    4
Name: Unnamed: 0, dtype: int64

In [42]:
type(classData['Name'])

pandas.core.series.Series

In [43]:
classData['Class']

0    1st Year
1    2nd Year
2    3rd Year
3    1st Year
4    2nd Year
Name: Class, dtype: object

In [44]:
classData['Name'][0]

'Ali Raza'

In [45]:
classData['Name'][0]=90

d:\anaconda\envs\mlabs\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [46]:
classData

   Unnamed: 0          Name  Marks     Class
0           0            90     88  1st Year
1           1    Zain Ahmed     67  2nd Year
2           2   Fatima Noor     91  3rd Year
3           3  Hassan Tariq     74  1st Year
4           4   Areeba Khan     59  2nd Year

In [47]:
classData['Class'][4]

'2nd Year'

In [48]:
classData['Name'][4]=5

d:\anaconda\envs\mlabs\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [57]:
classData['Name'][4]='Zain Ahmad'

d:\anaconda\envs\mlabs\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [58]:
classData

   Unnamed: 0          Name  Marks     Class
0           0            90     88  1st Year
1           1    Zain Ahmed     67  2nd Year
2           2   Fatima Noor     91  3rd Year
3           3  Hassan Tariq     74  1st Year
4           4    Zain Ahmad     59  2nd Year

In [60]:
classData["Name"][4]

'Zain Ahmad'

In [61]:
classData

   Unnamed: 0          Name  Marks     Class
0           0            90     88  1st Year
1           1    Zain Ahmed     67  2nd Year
2           2   Fatima Noor     91  3rd Year
3           3  Hassan Tariq     74  1st Year
4           4    Zain Ahmad     59  2nd Year

In [62]:
classData.to_csv('khandataset.csv')

In [63]:
classData.to_csv('kamrandataset.csv', index=False)

## Create Labels
With the index argument, you can name your own labels.

In [64]:
classData.index = ["First","Second", "Third", "Fourth", "Fifth"]

In [65]:
classData

        Unnamed: 0          Name  Marks     Class
First            0            90     88  1st Year
Second           1    Zain Ahmed     67  2nd Year
Third            2   Fatima Noor     91  3rd Year
Fourth           3  Hassan Tariq     74  1st Year
Fifth            4    Zain Ahmad     59  2nd Year

In [67]:
classData["Name"]["Fifth"]

'Zain Ahmad'

## Pandas 
Pandas is an open source data analysis library written in Python.<br>
It uses the power and speed of numpy to make data analysis and preprocessing easy for data scientists.<br>
__Pandas__ is used to analyze data.<br>
Python data analysis using pandas is a great start to Exploratory Data Analysis (EDA) for a data scientist.

## Pandas Data Structure
Panda has two types of Data Structure:<br> 
    a) Series<br>
    b) Dataframe
### Series
It is a one dimentional array with indexes. It stores a single column or row of data in a Dataframe.<br>
It is a one dimensional array capable of holding any type of data.
### Dataframe
It is a tabular spreadsheet like structure representing rows each of which contains one or more columns.<br>
It is a multi dimensional array capable of holding any type of data.<br>
__Series__ is like a column, a __DataFrame__ is the whole table.

In [68]:
classData['Name']

First               90
Second      Zain Ahmed
Third      Fatima Noor
Fourth    Hassan Tariq
Fifth       Zain Ahmad
Name: Name, dtype: object

In [70]:
type(classData['Name'])

pandas.core.series.Series

In [71]:
classData

        Unnamed: 0          Name  Marks     Class
First            0            90     88  1st Year
Second           1    Zain Ahmed     67  2nd Year
Third            2   Fatima Noor     91  3rd Year
Fourth           3  Hassan Tariq     74  1st Year
Fifth            4    Zain Ahmad     59  2nd Year

In [72]:
type(classData)

pandas.core.frame.DataFrame

In [73]:
import numpy as np

In [74]:
series1= pd.Series(np.random.rand())

In [75]:
series1

0    0.468242
dtype: float64

In [76]:
series1= pd.Series(np.random.rand(30))

In [77]:
series1

0     0.279308
1     0.003432
2     0.790185
3     0.813748
4     0.296629
5     0.691138
6     0.410018
7     0.576712
8     0.563559
9     0.979711
10    0.257622
11    0.404361
12    0.677596
13    0.664461
14    0.041802
15    0.662845
16    0.329638
17    0.599228
18    0.226790
19    0.591748
20    0.292527
21    0.301338
22    0.165982
23    0.054841
24    0.918399
25    0.091568
26    0.419557
27    0.824075
28    0.230150
29    0.838200
dtype: float64

In [78]:
type(series1)

pandas.core.series.Series

In [79]:
newDf = pd.DataFrame(np.random.rand(330,5))
# newDf = pd.DataFrame(np.random.rand(330,5), index=np.arange(330))

In [80]:
type(newDf)

pandas.core.frame.DataFrame

In [81]:
newDf

            0         1         2         3         4
0    0.789685  0.977052  0.694329  0.339724  0.369826
1    0.574201  0.542677  0.463366  0.516965  0.058495
2    0.165764  0.210743  0.697154  0.531916  0.887573
3    0.214773  0.935993  0.672346  0.555571  0.931546
4    0.376257  0.504940  0.188564  0.376936  0.961471
..        ...       ...       ...       ...       ...
325  0.262121  0.613199  0.722379  0.737437  0.945698
326  0.156977  0.990780  0.463461  0.368391  0.484654
327  0.953381  0.833934  0.668579  0.059110  0.589676
328  0.345876  0.760621  0.116214  0.618166  0.701776
329  0.710157  0.003680  0.947757  0.035574  0.154123

[330 rows x 5 columns]

In [82]:
newDf.head(2)

          0         1         2         3         4
0  0.789685  0.977052  0.694329  0.339724  0.369826
1  0.574201  0.542677  0.463366  0.516965  0.058495

In [83]:
newDf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [84]:
newDf.tail(2)

            0         1         2         3         4
328  0.345876  0.760621  0.116214  0.618166  0.701776
329  0.710157  0.003680  0.947757  0.035574  0.154123

In [85]:
newDf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 330 entries, 0 to 329
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       330 non-null    float64
 1   1       330 non-null    float64
 2   2       330 non-null    float64
 3   3       330 non-null    float64
 4   4       330 non-null    float64
dtypes: float64(5)
memory usage: 13.0 KB

In [86]:
newDf.describe()

                0           1           2           3           4
count  330.000000  330.000000  330.000000  330.000000  330.000000
mean     0.518751    0.524312    0.507207    0.489094    0.489568
std      0.279167    0.296572    0.299173    0.287523    0.289560
min      0.013550    0.002088    0.000734    0.001046    0.002101
25%      0.298869    0.263642    0.255111    0.253584    0.252643
50%      0.528441    0.537330    0.505992    0.497506    0.473949
75%      0.744455    0.777440    0.771866    0.739631    0.734960
max      0.998592    0.999032    0.996834    0.996010    0.998798

In [87]:
newDf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [88]:
newDf[0][0]= "Maaz Khan"

In [89]:
newDf.dtypes

0     object
1    float64
2    float64
3    float64
4    float64
dtype: object

In [90]:
newDf

             0         1         2         3         4
0    Maaz Khan  0.977052  0.694329  0.339724  0.369826
1     0.574201  0.542677  0.463366  0.516965  0.058495
2     0.165764  0.210743  0.697154  0.531916  0.887573
3     0.214773  0.935993  0.672346  0.555571  0.931546
4     0.376257  0.504940  0.188564  0.376936  0.961471
..         ...       ...       ...       ...       ...
325   0.262121  0.613199  0.722379  0.737437  0.945698
326   0.156977  0.990780  0.463461  0.368391  0.484654
327   0.953381  0.833934  0.668579  0.059110  0.589676
328   0.345876  0.760621  0.116214  0.618166  0.701776
329   0.710157  0.003680  0.947757  0.035574  0.154123

[330 rows x 5 columns]

In [91]:
newDf.index

RangeIndex(start=0, stop=330, step=1)

In [92]:
newDf.columns

RangeIndex(start=0, stop=5, step=1)

In [93]:
newDf.to_numpy()

array([['Maaz Khan', 0.9770515366054382, 0.6943290506151379,
        0.3397239824038698, 0.36982561754106524],
       [0.5742009012669018, 0.5426767726188481, 0.4633659120260998,
        0.5169649447302055, 0.058494803156548314],
       [0.16576376459702913, 0.21074348452649394, 0.6971540639801928,
        0.5319160517002354, 0.8875727814838043],
       ...,
       [0.9533808448218961, 0.8339340534494107, 0.6685787214386278,
        0.0591097463357233, 0.5896762483225992],
       [0.3458763513124312, 0.7606211733629141, 0.11621445391243124,
        0.6181660989179133, 0.7017763674288616],
       [0.7101573011423138, 0.0036798679752624297, 0.9477566228033747,
        0.03557366363380232, 0.15412259286196905]], dtype=object)

In [94]:
newDf[0][0]=0.30

d:\anaconda\envs\mlabs\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [95]:
newDf.head()

          0         1         2         3         4
0       0.3  0.977052  0.694329  0.339724  0.369826
1  0.574201  0.542677  0.463366  0.516965  0.058495
2  0.165764  0.210743  0.697154  0.531916  0.887573
3  0.214773  0.935993  0.672346  0.555571  0.931546
4  0.376257  0.504940  0.188564  0.376936  0.961471

In [96]:
newDf.T

,0,1,2,3,4,5,6,7,8,9,...,320,321,322,323,324,325,326,327,328,329
0,0.3,0.574201,0.165764,0.214773,0.376257,0.535987,0.0852839,0.43956,0.390097,0.765658,...,0.698149,0.338101,0.48022,0.52369,0.0833264,0.262121,0.156977,0.953381,0.345876,0.710157
1,0.977052,0.542677,0.210743,0.935993,0.50494,0.719724,0.369916,0.995334,0.452013,0.962762,...,0.661283,0.831391,0.107611,0.239381,0.160029,0.613199,0.99078,0.833934,0.760621,0.00367987
2,0.694329,0.463366,0.697154,0.672346,0.188564,0.339494,0.0881187,0.354883,0.899275,0.406351,...,0.812024,0.0335955,0.821568,0.947439,0.501554,0.722379,0.463461,0.668579,0.116214,0.947757
3,0.339724,0.516965,0.531916,0.555571,0.376936,0.481582,0.710513,0.668674,0.527964,0.980004,...,0.125019,0.176084,0.423748,0.588048,0.582624,0.737437,0.368391,0.0591097,0.618166,0.0355737
4,0.369826,0.0584948,0.887573,0.931546,0.961471,0.873934,0.0781975,0.743501,0.119667,0.472737,...,0.358049,0.907423,0.0201891,0.541124,0.401569,0.945698,0.484654,0.589676,0.701776,0.154123

In [97]:
newDf.sort_index(axis=0)

            0         1         2         3         4
0         0.3  0.977052  0.694329  0.339724  0.369826
1    0.574201  0.542677  0.463366  0.516965  0.058495
2    0.165764  0.210743  0.697154  0.531916  0.887573
3    0.214773  0.935993  0.672346  0.555571  0.931546
4    0.376257  0.504940  0.188564  0.376936  0.961471
..        ...       ...       ...       ...       ...
325  0.262121  0.613199  0.722379  0.737437  0.945698
326  0.156977  0.990780  0.463461  0.368391  0.484654
327  0.953381  0.833934  0.668579  0.059110  0.589676
328  0.345876  0.760621  0.116214  0.618166  0.701776
329  0.710157  0.003680  0.947757  0.035574  0.154123

[330 rows x 5 columns]

In [98]:
newDf.sort_index(axis=0, ascending=False)

            0         1         2         3         4
329  0.710157  0.003680  0.947757  0.035574  0.154123
328  0.345876  0.760621  0.116214  0.618166  0.701776
327  0.953381  0.833934  0.668579  0.059110  0.589676
326  0.156977  0.990780  0.463461  0.368391  0.484654
325  0.262121  0.613199  0.722379  0.737437  0.945698
..        ...       ...       ...       ...       ...
4    0.376257  0.504940  0.188564  0.376936  0.961471
3    0.214773  0.935993  0.672346  0.555571  0.931546
2    0.165764  0.210743  0.697154  0.531916  0.887573
1    0.574201  0.542677  0.463366  0.516965  0.058495
0         0.3  0.977052  0.694329  0.339724  0.369826

[330 rows x 5 columns]

In [99]:
newDf.sort_index(axis=1)

            0         1         2         3         4
0         0.3  0.977052  0.694329  0.339724  0.369826
1    0.574201  0.542677  0.463366  0.516965  0.058495
2    0.165764  0.210743  0.697154  0.531916  0.887573
3    0.214773  0.935993  0.672346  0.555571  0.931546
4    0.376257  0.504940  0.188564  0.376936  0.961471
..        ...       ...       ...       ...       ...
325  0.262121  0.613199  0.722379  0.737437  0.945698
326  0.156977  0.990780  0.463461  0.368391  0.484654
327  0.953381  0.833934  0.668579  0.059110  0.589676
328  0.345876  0.760621  0.116214  0.618166  0.701776
329  0.710157  0.003680  0.947757  0.035574  0.154123

[330 rows x 5 columns]

In [100]:
newDf.sort_index(axis=1, ascending=False)

            4         3         2         1         0
0    0.369826  0.339724  0.694329  0.977052       0.3
1    0.058495  0.516965  0.463366  0.542677  0.574201
2    0.887573  0.531916  0.697154  0.210743  0.165764
3    0.931546  0.555571  0.672346  0.935993  0.214773
4    0.961471  0.376936  0.188564  0.504940  0.376257
..        ...       ...       ...       ...       ...
325  0.945698  0.737437  0.722379  0.613199  0.262121
326  0.484654  0.368391  0.463461  0.990780  0.156977
327  0.589676  0.059110  0.668579  0.833934  0.953381
328  0.701776  0.618166  0.116214  0.760621  0.345876
329  0.154123  0.035574  0.947757  0.003680  0.710157

[330 rows x 5 columns]

In [101]:
newDf.head()

          0         1         2         3         4
0       0.3  0.977052  0.694329  0.339724  0.369826
1  0.574201  0.542677  0.463366  0.516965  0.058495
2  0.165764  0.210743  0.697154  0.531916  0.887573
3  0.214773  0.935993  0.672346  0.555571  0.931546
4  0.376257  0.504940  0.188564  0.376936  0.961471

In [102]:
newDf[0][1]

0.5742009012669018

In [103]:
type(newDf[0])

pandas.core.series.Series

In [104]:
newDf

            0         1         2         3         4
0         0.3  0.977052  0.694329  0.339724  0.369826
1    0.574201  0.542677  0.463366  0.516965  0.058495
2    0.165764  0.210743  0.697154  0.531916  0.887573
3    0.214773  0.935993  0.672346  0.555571  0.931546
4    0.376257  0.504940  0.188564  0.376936  0.961471
..        ...       ...       ...       ...       ...
325  0.262121  0.613199  0.722379  0.737437  0.945698
326  0.156977  0.990780  0.463461  0.368391  0.484654
327  0.953381  0.833934  0.668579  0.059110  0.589676
328  0.345876  0.760621  0.116214  0.618166  0.701776
329  0.710157  0.003680  0.947757  0.035574  0.154123

[330 rows x 5 columns]

## view

In [105]:
newDfView=newDf

In [106]:
newDfView

            0         1         2         3         4
0         0.3  0.977052  0.694329  0.339724  0.369826
1    0.574201  0.542677  0.463366  0.516965  0.058495
2    0.165764  0.210743  0.697154  0.531916  0.887573
3    0.214773  0.935993  0.672346  0.555571  0.931546
4    0.376257  0.504940  0.188564  0.376936  0.961471
..        ...       ...       ...       ...       ...
325  0.262121  0.613199  0.722379  0.737437  0.945698
326  0.156977  0.990780  0.463461  0.368391  0.484654
327  0.953381  0.833934  0.668579  0.059110  0.589676
328  0.345876  0.760621  0.116214  0.618166  0.701776
329  0.710157  0.003680  0.947757  0.035574  0.154123

[330 rows x 5 columns]

In [107]:
newDfView[0][0]=765

d:\anaconda\envs\mlabs\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [108]:
newDf.head()

          0         1         2         3         4
0       765  0.977052  0.694329  0.339724  0.369826
1  0.574201  0.542677  0.463366  0.516965  0.058495
2  0.165764  0.210743  0.697154  0.531916  0.887573
3  0.214773  0.935993  0.672346  0.555571  0.931546
4  0.376257  0.504940  0.188564  0.376936  0.961471

In [109]:
newDfView.head()

          0         1         2         3         4
0       765  0.977052  0.694329  0.339724  0.369826
1  0.574201  0.542677  0.463366  0.516965  0.058495
2  0.165764  0.210743  0.697154  0.531916  0.887573
3  0.214773  0.935993  0.672346  0.555571  0.931546
4  0.376257  0.504940  0.188564  0.376936  0.961471

In [110]:
newDfCopy=newDf.copy()

In [111]:
newDfCopy[0][0]=656

d:\anaconda\envs\mlabs\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [112]:
newDf.head()

          0         1         2         3         4
0       765  0.977052  0.694329  0.339724  0.369826
1  0.574201  0.542677  0.463366  0.516965  0.058495
2  0.165764  0.210743  0.697154  0.531916  0.887573
3  0.214773  0.935993  0.672346  0.555571  0.931546
4  0.376257  0.504940  0.188564  0.376936  0.961471

In [113]:
newDfCopy.head()

          0         1         2         3         4
0       656  0.977052  0.694329  0.339724  0.369826
1  0.574201  0.542677  0.463366  0.516965  0.058495
2  0.165764  0.210743  0.697154  0.531916  0.887573
3  0.214773  0.935993  0.672346  0.555571  0.931546
4  0.376257  0.504940  0.188564  0.376936  0.961471

## loc

In [114]:
newDf.head(2)

          0         1         2         3         4
0       765  0.977052  0.694329  0.339724  0.369826
1  0.574201  0.542677  0.463366  0.516965  0.058495

In [115]:
newDf.loc[0,0]

765

In [116]:
newDf.loc[0,0]=5678

In [117]:
newDf.head(2)

          0         1         2         3         4
0      5678  0.977052  0.694329  0.339724  0.369826
1  0.574201  0.542677  0.463366  0.516965  0.058495

In [118]:
newDf.loc[0,4]

0.36982561754106524

In [119]:
newDf.loc[325,1]

0.6131992421108748

In [120]:
newDf.loc[0,0]=9875

In [121]:
newDf.head(2)

          0         1         2         3         4
0      9875  0.977052  0.694329  0.339724  0.369826
1  0.574201  0.542677  0.463366  0.516965  0.058495

In [122]:
newDf.columns=list("ABCDE")

In [123]:
newDf.head(3)

          A         B         C         D         E
0      9875  0.977052  0.694329  0.339724  0.369826
1  0.574201  0.542677  0.463366  0.516965  0.058495
2  0.165764  0.210743  0.697154  0.531916  0.887573

In [124]:
newDf.loc[0, "A"]

9875

In [125]:
newDf.loc[0,"A"]=65

In [126]:
newDf.head(3)

          A         B         C         D         E
0        65  0.977052  0.694329  0.339724  0.369826
1  0.574201  0.542677  0.463366  0.516965  0.058495
2  0.165764  0.210743  0.697154  0.531916  0.887573

In [127]:
newDf.loc[35,"A"]

0.48655083557459466

In [128]:
newDf.drop(0, axis=0).head(3)

          A         B         C         D         E
1  0.574201  0.542677  0.463366  0.516965  0.058495
2  0.165764  0.210743  0.697154  0.531916  0.887573
3  0.214773  0.935993  0.672346  0.555571  0.931546

In [129]:
newDf.drop("A", axis=1).head(3)

          B         C         D         E
0  0.977052  0.694329  0.339724  0.369826
1  0.542677  0.463366  0.516965  0.058495
2  0.210743  0.697154  0.531916  0.887573

In [130]:
newDf.head(3)

          A         B         C         D         E
0        65  0.977052  0.694329  0.339724  0.369826
1  0.574201  0.542677  0.463366  0.516965  0.058495
2  0.165764  0.210743  0.697154  0.531916  0.887573

In [131]:
newDf = newDf.drop("A", axis=1)

In [132]:
newDf.head(3)

          B         C         D         E
0  0.977052  0.694329  0.339724  0.369826
1  0.542677  0.463366  0.516965  0.058495
2  0.210743  0.697154  0.531916  0.887573

In [133]:
newDf.loc[[1,2],["C","D"]]

          C         D
1  0.463366  0.516965
2  0.697154  0.531916

In [134]:
newDf.head(3)

          B         C         D         E
0  0.977052  0.694329  0.339724  0.369826
1  0.542677  0.463366  0.516965  0.058495
2  0.210743  0.697154  0.531916  0.887573

In [135]:
newDf.loc[:,["C","D"]]

            C         D
0    0.694329  0.339724
1    0.463366  0.516965
2    0.697154  0.531916
3    0.672346  0.555571
4    0.188564  0.376936
..        ...       ...
325  0.722379  0.737437
326  0.463461  0.368391
327  0.668579  0.059110
328  0.116214  0.618166
329  0.947757  0.035574

[330 rows x 2 columns]

In [136]:
newDf.loc[[1,2],:]

          B         C         D         E
1  0.542677  0.463366  0.516965  0.058495
2  0.210743  0.697154  0.531916  0.887573

In [137]:
newDf.loc[:5,["C","D"]]

          C         D
0  0.694329  0.339724
1  0.463366  0.516965
2  0.697154  0.531916
3  0.672346  0.555571
4  0.188564  0.376936
5  0.339494  0.481582

In [138]:
newDf.loc[[1,2],:"D"]

          B         C         D
1  0.542677  0.463366  0.516965
2  0.210743  0.697154  0.531916

In [139]:
newDf.loc[(newDf["B"]<0.3)]

            B         C         D         E
2    0.210743  0.697154  0.531916  0.887573
16   0.117230  0.969197  0.326858  0.576457
23   0.202772  0.579144  0.498145  0.589919
35   0.076542  0.212095  0.291189  0.489243
37   0.033642  0.096136  0.048017  0.993926
..        ...       ...       ...       ...
316  0.079067  0.536986  0.958330  0.954606
322  0.107611  0.821568  0.423748  0.020189
323  0.239381  0.947439  0.588048  0.541124
324  0.160029  0.501554  0.582624  0.401569
329  0.003680  0.947757  0.035574  0.154123

[91 rows x 4 columns]

In [140]:
newDf.loc[(newDf["B"]<0.3) & (newDf["D"]>0.2)]

            B         C         D         E
2    0.210743  0.697154  0.531916  0.887573
16   0.117230  0.969197  0.326858  0.576457
23   0.202772  0.579144  0.498145  0.589919
35   0.076542  0.212095  0.291189  0.489243
43   0.058092  0.293087  0.588598  0.964222
..        ...       ...       ...       ...
307  0.039496  0.975592  0.722787  0.408015
316  0.079067  0.536986  0.958330  0.954606
322  0.107611  0.821568  0.423748  0.020189
323  0.239381  0.947439  0.588048  0.541124
324  0.160029  0.501554  0.582624  0.401569

[70 rows x 4 columns]

In [141]:
newDf.head(3)

          B         C         D         E
0  0.977052  0.694329  0.339724  0.369826
1  0.542677  0.463366  0.516965  0.058495
2  0.210743  0.697154  0.531916  0.887573

## iloc

In [142]:
newDf.iloc[0,0]

0.9770515366054382

In [143]:
newDf.iloc[0,0]=555

In [144]:
newDf.head()

            B         C         D         E
0  555.000000  0.694329  0.339724  0.369826
1    0.542677  0.463366  0.516965  0.058495
2    0.210743  0.697154  0.531916  0.887573
3    0.935993  0.672346  0.555571  0.931546
4    0.504940  0.188564  0.376936  0.961471

In [145]:
newDf.iloc[[0,4],[1,3]]

          C         E
0  0.694329  0.369826
4  0.188564  0.961471

In [146]:
newDf.head(4)

            B         C         D         E
0  555.000000  0.694329  0.339724  0.369826
1    0.542677  0.463366  0.516965  0.058495
2    0.210743  0.697154  0.531916  0.887573
3    0.935993  0.672346  0.555571  0.931546

In [147]:
newDf.drop(0).head()

          B         C         D         E
1  0.542677  0.463366  0.516965  0.058495
2  0.210743  0.697154  0.531916  0.887573
3  0.935993  0.672346  0.555571  0.931546
4  0.504940  0.188564  0.376936  0.961471
5  0.719724  0.339494  0.481582  0.873934

In [148]:
# newDf.drop(0, axis=1)

In [149]:
# newDf.drop("B", axis=1).head()

In [150]:
newDf.drop(["C", "D"], axis=1).head()

            B         E
0  555.000000  0.369826
1    0.542677  0.058495
2    0.210743  0.887573
3    0.935993  0.931546
4    0.504940  0.961471

In [151]:
newDf.head()

            B         C         D         E
0  555.000000  0.694329  0.339724  0.369826
1    0.542677  0.463366  0.516965  0.058495
2    0.210743  0.697154  0.531916  0.887573
3    0.935993  0.672346  0.555571  0.931546
4    0.504940  0.188564  0.376936  0.961471

In [152]:
newDf.drop(['B', 'D'], axis=1, inplace=True)

In [153]:
newDf.head()

          C         E
0  0.694329  0.369826
1  0.463366  0.058495
2  0.697154  0.887573
3  0.672346  0.931546
4  0.188564  0.961471

In [154]:
newDf.reset_index().head()

   index         C         E
0      0  0.694329  0.369826
1      1  0.463366  0.058495
2      2  0.697154  0.887573
3      3  0.672346  0.931546
4      4  0.188564  0.961471

In [155]:
newDf.reset_index(drop=True).head()

          C         E
0  0.694329  0.369826
1  0.463366  0.058495
2  0.697154  0.887573
3  0.672346  0.931546
4  0.188564  0.961471

In [156]:
newDf.head()

          C         E
0  0.694329  0.369826
1  0.463366  0.058495
2  0.697154  0.887573
3  0.672346  0.931546
4  0.188564  0.961471

In [157]:
newDf.reset_index(drop=True, inplace=True)

In [158]:
newDf.head()

          C         E
0  0.694329  0.369826
1  0.463366  0.058495
2  0.697154  0.887573
3  0.672346  0.931546
4  0.188564  0.961471

# Groupby
The groupby method allows you to group rows of data together and call aggregate functions

â€‹
â€‹

In [159]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [160]:
df = pd.DataFrame(data)

In [161]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

### Now you can use the .groupby() method to group rows together based off of a column name.
For instance let's group based off of Company. This will create a DataFrameGroupBy object:

In [162]:
df.groupby('Company')

##### You can save this object as a new variable:

In [163]:
by_comp = df.groupby("Company")
type(by_comp)

pandas.core.groupby.generic.DataFrameGroupBy

#### And then call aggregate methods of the object:

In [164]:
by_comp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [165]:
df.groupby('Company').mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [166]:
by_comp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [167]:
by_comp.min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [168]:
by_comp.max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [169]:
by_comp.count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [170]:
by_comp.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0